# vsoWidgetPopupClear

## Description
```pascal
PROCEDURE vsoWidgetPopupClear(widgetID : LONGINT);
```

```python

def vs.vsoWidgetPopupClear(widgetID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events